numList = sorted(input(), reverse=True)

def solution():
    maxNum = "".join(numList)
    if "0" in numList and int(maxNum) % 30 == 0:
        return maxNum
    return -1

print(solution())


# 3 6 9
# 12 15 18
# 21 24 27
# 30 33 36 39
# 42 45 48
# 51 54 57
# 60 63 66 69
#
# 90 93 96 99
# 102 105 108
# 111 114 117
# 120 123 126 129
# 132 135 138
# 3 6 9 2 5 8 1 4 7 0

# 990 993 996 999
# 1002 1005 1008
#

# 3의 배수 0 3 6 9
# 3의 배수 -1: 1 4 7
# 3의 배수 -2: 2 5 8

# 0이 포함되어 있고, 나머지 숫자들로 3의 배수를 만들 수 있느냐
# [('1', '1', '0'), ('1', '0', '1'), ('1', '1', '0'), ('1', '0', '1'), ('0', '1', '1'), ('0', '1', '1')]